---
kind: type
id: T:Autodesk.Revit.DB.NullParameterValue
source: html/fe10010f-e127-7248-1f17-8c1ee0d41ea0.htm
---
# Autodesk.Revit.DB.NullParameterValue

A class that represent an empty (null) value of a parameter element.

## Syntax (C#)
```csharp
public class NullParameterValue : ParameterValue
```